Tekla.Structures.Drawing.NewLineElement
The NewLineElement class defines a line feed between the desired elements to create multi-row marks.

Tekla.Structures.Drawing.NewLineElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.NewLineElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if both objects are new line elements.

Tekla.Structures.Drawing.NewLineElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.